app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY id ASC LIMIT 20
---
  def index
    @product = Product.order('id ASC').limit(20)

SELECT  `products`.* FROM `products` WHERE (title LIKE('%%')) LIMIT 20
---
  def search
    @product = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)