app/controllers/reviews_controller.rb

  def new
    @product = Product.find(params[:product_id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`rate`, `review`, `product_id`, `nickname`, `created_at`, `updated_at`) VALUES (10, 'fericy', 2, 'b', '2018-05-08 04:00:43', '2018-05-08 04:00:43')